{
    "1": "If there is a tick in the above box, you have Been Here Before. Turn to 14. Otherwise, read on.\r\n           The gates of Boulder Ford are made of thick oak reinforced with iron bands, and set\r\nwithin a sturdy stone gatehouse. Still, that should pose little problem to a determined beast\r\nsuch as yourself. Ignoring the shouts and screams of the Gnomish guards, you proceed to\r\nwrench the gates apart.\r\n           Roll one die. If it is less than your STRENGF score, tick the box above, and turn to 26.\r\nIf it is equal to or greater than your STRENGF score, you fail to open the gate. Deduct one\r\npoint from your TUFF score to reflect both your efforts and the Gnomish arrows bouncing off\r\nyour hardened hide. If your TUFF score is now zero, turn to 13.\r\n           Otherwise, try again by rolling one die and comparing it to your STRENGF score in\r\nthe manner above. Keep doing this until you either open the gates, or die trying!\r\nAlternatively, you could decide the whole thing is too much hard work and wander back to\r\nyour cave. If you decide to do this, turn to 50.",
    "2": "You are at the forge. Tick off a Time Box. If you have ticked off five Time Boxes, turn to 50.\r\nOtherwise, you can go:\r\n       North, to Brilligan’s Keep                        turn to 25\r\n       South, to the market                              turn to 45\r\n       East, to the Temple of Goff                       turn to 15\r\n       West, to the mansion of Bronze the Merchant       turn to 35",
    "3": "The Blue Crab Tavern looks like it has been ransacked by a mob of green-skinned Gorks. If\r\nthere is a tick in the above box, you have Been Here Before. Turn to 22. Otherwise, read on.\r\n          The innkeeper, a fat red-faced Gnome called Vaed Thol, sits weeping on a keg\r\noutside the ruins of his tavern. On seeing you return, he rises to his feet waving a chair leg\r\nmenacingly in your direction.\r\n          “You heartless bastard!” Vaed howls. “I was going to sell the place and retire to a\r\nbamboo beach hut on Skull Island. I’ll make you pay for this!”\r\n          Defend yourself against the irate barman.\r\n\r\nVAED THOL THE INNKEEPERSTRENGF 1 TUFF 1 HURT 1\r\n\r\nYou may throw a Boulder at Vaed if you have one. If Vaed reduces your TUFF score to zero,\r\nturn to 13. If you want to flee, turn to 22. If you reduce Vaed’s TUFF score to zero, you have\r\nslain the innkeeper. Tick the box above. You may add the Keg of Beer (1 Food Point) he was\r\nsitting on, to your Sack. Turn to 22.",
    "4": "Gastromo wipes his free hand on the hem of his robe, and after reaching into a pocket,\r\nscatters a fistful of tiny teeth upon the ground. In a moment, the magical blue light has\r\ntransformed every tooth into a short, brown-skinned Yobbo, which are highly carnivorous\r\nhumanoids related to Gorks. Lacking weapons, the horde of Yobbos hurl themselves at you in\r\na great scaly wave, biting at your calves and gnawing on your kneecaps. Fight them as one\r\nopponent.\r\n\r\nHORDE OF YOBBOS                   STRENGF 2                 TUFF 8 HURT 1\r\n\r\n\r\n\r\nYou may throw a Boulder at the Yobbos if you have one. If the Yobbos reduce your TUFF\r\nscore to zero, turn to 13. If you want to flee, turn to 12. If you reduce the horde’s TUFF score\r\nto zero, you have beaten the majority of them off, and the rest fled into the streets to harass\r\neasier prey.\r\n         Gastromo meanwhile, has used the diversion to waddle back into his tower and\r\nspell-lock the door. You can:\r\n         Assault the tower        turn to 18\r\n         Leave the area           turn to 12",
    "5": "If there is a tick in the above box, you have Been Here Before. Turn to 23. Otherwise, read on.\r\n           The forge of Boulder Ford is a stout stone-walled building with a tall smoking\r\nchimney. Mirroring the latter is the Dwarven smith Stubbs, who stands proudly outside his\r\nworkplace puffing on a pipe and leaning on a warhammer.\r\n           “Was wondering when you were going to show up,” he says, blowing smoke rings\r\ninto the sky. “Need the practice. Haven’t slain any of your kind in years.”\r\n           Enraged by the smith’s words and nonchalant attitude you howl a battle-cry and\r\nattack!\r\n\r\nSTUBBS THE DWARF SMITH STRENGF 3                           TUFF 4 HURT 2\r\n\r\nYou may throw a Boulder at Stubbs if you have one. If Stubbs reduces your TUFF score to\r\nzero, turn to 13. If you want to flee, turn to 2. If you reduce Stubb’s TUFF score to zero, you\r\nhave slain the insolent Dwarf. Tick the box above, and turn to 19.",
    "6": "You crack open one of the kegs to test that it’s “still fresh”. Draining it in one long gulp, you\r\nthrow the keg aside and open another, finishing it just as quickly. You may restore 2 TUFF\r\npoints if wounded, for the wonderful curative properties of good ale. However, you must tick\r\noff a Time Box as you been wasting time sitting here drinking (and if you have ticked off five\r\nTime Boxes, turn to 50). You’re also drunk. Reduce your SMARTS score by 1, unless it is 2\r\nalready (it can’t go any lower!). Hic! You save a final keg for future reference - add a Keg of\r\nBeer (1 Food Point) to your Sack, and turn to 22.",
    "7": "You are at the gates of Boulder Ford. Tick off a Time Box. If you have ticked off five Time\r\nBoxes, turn to 50. Otherwise, you can go:\r\n        North, to the market                                                   turn to 45\r\n        South, to your cave                                                    turn to 50",
    "8": "The Temple of Goff lies in ruins, the statue of the god now little more than a pile of rocks.\r\n         “Iconoclast! Despoiler! Destroyer! I curse you for returning to the scene of your\r\nblasphemous crimes!” moans the ravaged head of the statue of Goff from amidst the rubble.\r\n         Roll one die. If you roll under your SMARTS score, you are immune to the effects of\r\nthe statue’s curse. Turn to 17.\r\n         If you roll equal to or over your SMARTS score, you have been cursed! Halve your\r\nSTRENGF, TUFF, and SMARTS scores, rounding all fractions up to a minimum score of 2.\r\nThe curse will last for as long as you remain in Boulder Ford (i.e. the rest of this adventure).\r\nFor now, turn to 17.",
    "9": "Enough with the sorcery! Now is the time to smite this old Gnomish priest and grind his\r\nbones into the dirt! Resigning himself to his fate, the Curer casts one last spell that covers him\r\nin a glittering panoply of golden sparks that enervates him somewhat, and advances slowly\r\ntowards you brandishing his staff.\r\n\r\nTHE CURER                        STRENGF 2                 TUFF 2 HURT 2\r\n\r\nYou may throw a Boulder at the Curer if you have one. If the Curer reduces your TUFF score\r\nto zero, turn to 13. If you want flee, turn to 17. If you reduce the Curer’s TUFF score to zero,\r\nyou crush the irritating priest underfoot, and continue ransacking the Temple of Goff.\r\n         By the careful act of smashing the roof-dome and reaching inside, you extract several\r\ninteresting items. Add any of the following to your Rampage Sheet: a Sack, a Silver\r\nCandelabra (1 Loot Point), a Gold Statue of Goff (2 Loot Points). When you have finished\r\nhere, turn to 17.",
    "10": "If there is a tick in the above box, you have Been Here Before. Turn to 18. Otherwise, read on.\r\n           Gastromo’s Tower stands like a white fang looming above the Gnomish dwellings of\r\nBoulder Ford. Gastromo is a human spellcaster who is good friends with King Brilligan of the\r\nGnomes, and has lived in the town for decades. Some say Gastromo’s price for helping to\r\ndefend Boulder Ford is an unlimited tab at the local bakery.\r\n           Suddenly the thick door at the base of the tower is thrown open! The fat wizard\r\nhimself, azure robes straining from containing his enormous bulk, comes shambling out,\r\nwiping crumbs from his long white beard and licking his fingers clean. He points one hand at\r\nyou, makes a series of arcane gestures, and, still with a mouthful of food, mutters something\r\nunintelligible. Instantly, the air around you is filled with a glowing blue flash of light.\r\n           Gastromo has cast a spell upon you! Tick the box above and roll one die. Turn to the\r\nparagraph indicated to discover the effect of his magic:\r\n           Roll 1 to 2        turn to 46\r\n           Roll 3 to 4        turn to 16\r\n           Roll 5 to 6        turn to 4",
    "11": "The Blue Crab Tavern lies undefended and at your mercy! Of course, you’re too big to enter\r\nthe place, but you stick an arm through a window and scrabble around for barrels or kegs to\r\ngrab. Roll one die. If you roll under your SMARTS score, add a Keg of Beer (1 Food Point) to\r\nyour Sack, and turn to 22.\r\n        If you roll equal to or over your SMARTS score, you pull out a keg of beer, and then\r\nanother, and then another…turn to 6.",
    "12": "You are at the tower of Gastromo the Wizard. Tick off a Time Box. If you have ticked off five\r\nTime Boxes, turn to 50. Otherwise, you can go:\r\n       South, to the mansion of Bronze the Merchant                     turn to 35\r\n       East, to Brilligan’s Keep                                        turn to 25",
    "13": "You are dead! You have perished in your lone assault on Boulder Ford. As in any game\r\nhowever, the only proper response to failure is to try harder! Choose another monster (or\r\ncreate your own using the rules on page 25), fill in the appropriate details on a new Rampage\r\nSheet, and turn to 1.",
    "14": "The gates of Boulder Ford have been torn from their hinges and the garrison of guards have\r\nlong since fled. If there is a tick in the above box, you have Been Here Before. Turn to 7. Otherwise,\r\nread on.\r\n         “Flippin’ heck!” mutters a female human adventurer who has just wandered into\r\ntown through the ruined archway. “All I wanted was a hot bath and a soft bed! I am Vaitharre\r\nthe Adventuress, and I will not be denied!”\r\n         Unsheathing a magical sword that glows with emerald flames, she attacks you with\r\nspeed and precision. Defend yourself!\r\n\r\nVAITHARRE THE ADVENTURESS                   STRENGF 3        TUFF 4 HURT 2\r\n\r\nYou may throw a Boulder at Vaitharre if you have one. If Vaitharre reduces your TUFF score\r\nto zero, turn to 13. If you want to flee, turn to 7. If you reduce Vaitharre’s TUFF score to zero,\r\nyou have slain the adventuress. Tick the box above. If you want, you can add her Fire Sword\r\n(2 Loot Points) to your Sack (as it is too small for you to use, except perhaps as a flaming\r\ntoothpick). When you have finished here, turn to 7.",
    "15": "If there is a tick in the above box, you have Been Here Before. Turn to 8. Otherwise, read on.\r\n           The Temple of Goff is the most important religious edifice in the Shrine District of\r\nBoulder Ford. Goff is the patron earth god of the Gnomes, and the enormous stone statue of\r\nhim outside the temple depicts Goff as a muscular, serious-looking Gnome with spiky hair\r\nand beard, black robes, and a huge steel broadsword.\r\n           Even as you look on, the statue suddenly comes to life, and clambers down from its\r\nplinth! As it stomps towards you on legs of rock, waving the great sword about in murderous\r\nfashion, you realize with horror that it is just about as tall as you are.\r\n           “Desecrator! Prepare to pay for your sins!” it intones in a thunderous voice. “Those\r\nwho defile the Temple the Goff face certain death!”\r\n           You must fight the statue of the earth god in a titanic combat that shakes the very\r\nground itself!\r\n\r\nSTATUE OF GOFF                              STRENGF 5        TUFF 4 HURT 3\r\n\r\nYou may throw a Boulder at the statue if you have one. If the statue reduces your TUFF score\r\nto zero, turn to 13. If you want to flee, turn to 17. If you reduce the statue’s TUFF score to\r\nzero, you have defeated the avatar of Goff! Tick the box above, and add 2 Chaos Points for\r\nyour glorious victory!\r\n         The statue is now little more than a pile of boulder-sized rubble. In fact, you can add\r\na Boulder to your Rampage Sheet if you don’t already have one. You can also take the statue’s\r\nweapon, this is the legendary Sword of Goff (HURT 3)! If you choose to do this, add the\r\nSword of Goff to your Rampage Sheet and cross off your original weapon, as you cannot\r\ncarry two weapons the same time. When you have finished here, turn to 44.",
    "16": "Glowing blue chains of scorching electrical energy surround you in a crackling prison. The\r\nsorcery rends a hole in space, and, in the blink of an eye, teleports you away from your\r\ncurrent location to another part of the town. Roll one die and turn to the paragraph indicated\r\nto discover which area of Boulder Ford you have been zapped into:\r\n        Roll 1 or 2      turn to 20\r\n        Roll 3 or 4      turn to 25\r\n\r\n\r\n\r\n        Roll 5 or 6     turn to 40",
    "17": "You are at the Temple of Goff. Tick off a Time    Box. If you have ticked off five Time Boxes,\r\nturn to 50. Otherwise, you can go:\r\n         North, to the Workshop of Hicobemus       turn to 40\r\n         South, to the livestock pens              turn to 30\r\n         West, to the forge                        turn to 5",
    "18": "If there is a tick in the above box, you have Been Here Before. Turn to 49. Otherwise, read on.\r\n           Gastromo’s white-walled tower sits spell-tight and magically locked. It will take an\r\nimmense effort to break through its defences.\r\n           If you do not wish to do this and want to head elsewhere, turn to 12.\r\n           If you want to attempt to flatten the tower, roll one die and add one (except if you\r\nhave the Sword of Goff, in which case just roll one die). If the result is less than your\r\nSTRENGF score, tick the box above, and turn to 21. If the result is equal to or greater than\r\nyour STRENGF score, you fail to raze the tower. Deduct one point from your TUFF score to\r\nreflect your strenuous exertion against the tower’s defensive enchantments. If your TUFF\r\nscore is now zero, turn to 13.\r\n           Otherwise, try again by rolling one die and adding one (except if you have the Sword\r\nof Goff), and comparing it to your STRENGF score in the manner above. Keep doing this until\r\nyou either obliterate the tower, or die trying! Alternatively, you could decide the whole thing\r\nis too much hard work and wander somewhere else. If you decide to do this, turn to 12.",
    "19": "You ransack the forge by lifting the roof off the building, and reach inside with a grubby fist.\r\nMost of its contents are useless, but you can add a Boulder to your Rampage Sheet if you\r\ndon’t already have one. You also find a Shield that is big enough for you to use. If you are\r\nwounded, whether in combat or by a spell or an explosion, roll one die. On a roll of a 1, the\r\nShield blocks the blow and you suffer no damage. Add the Shield to your Rampage Sheet if\r\nyou wish to take it.\r\n        Unfortunately, you knock over a barrel of pitch, which spills into the fireplace, and\r\nbefore long the entire forge is ablaze with roaring flames. Add 2 Chaos Points for all the\r\ndamage caused, and roll one die.\r\n        If you roll under your SMARTS score, you manage to avoid the flames. Turn to 2.\r\n        If you roll equal to or over your SMARTS score, deduct 1 point from your TUFF score\r\ndue to the burns you suffer in the process. If your TUFF score is now zero, turn to 13.\r\nOtherwise, turn to 2.",
    "20": "If there is a tick in the above box, you have Been Here Before. Turn to 3. Otherwise, read on.\r\n           The Blue Crab Tavern sits atop a grassy rise overlooking the market, and as you\r\nstomp up the path towards it, most of the patrons flee out the back and away to the north.\r\nOne figure remains, a tall muscular human holding a dark-bladed sword. It is none other\r\nthan Yadda Blackhead, an albino warrior with a bad skin complexion. His magical blade\r\nSoultaker is sentient and reputed to steal the spirits of those it wounds.\r\n           “Every bloody time!” he rants at you. “Can’t you monsters give me a moment’s\r\npeace? All I want is a quiet afternoon quaffing ale and carousing with tavern wenches, but,\r\nno, you have to decide to attack Boulder Ford today…”\r\n\r\n\r\n\r\n        “Could be worse,” adds Soultaker in a metallic voice. “At least it’s not Malthus Fire,\r\nseeking revenge for that time with his wife Delectia when you…”\r\n        “Silence!’ screams Yadda, charging towards you, waving the talkative sword. You\r\nmust fight one of the greatest heroes in all Gallansia!\r\n\r\nYADDA BLACKHEAD                  STRENGF 4         TUFF 4     HURT 2\r\n\r\nYou may throw a Boulder at Yadda if you have one. Every time Yadda wounds you, you\r\nmust deduct 2 points from your TUFF score and add them to Yadda’s TUFF score as\r\nSoultaker leeches away your vital energies. If Yadda reduces your TUFF score to zero, turn to\r\n13. If you want to flee, turn to 22. If you reduce Yadda’s TUFF score to zero, you have\r\ntriumphed over one of Gallansia’s selected scions of glory! Tick the box above, and add 1\r\nChaos Point for your epic victory.\r\n        If you want, you may add Soultaker (3 Loot Points) to your Sack as it’s too small for\r\nyou to use as a weapon. However, you must reduce your SMARTS score by 1 (unless it is 2\r\nalready it can’t go any lower!), as the blade’s constant prattling gets on your nerves (“What?\r\nNo! Don’t put me in there! By Vulang, what are these horrible stains?” And so on…). When\r\nyou have finished here, turn to 11.",
    "21": "You succeed in toppling the tower of Gastromo the Wizard, despite whatever magic he had\r\nenchanted his dwelling with! With a long inhuman groan, the whole structure collapses in on\r\nitself, raising a huge cloud of white dust. Add 1 Chaos Point.\r\n          Coughing and retching, you pick over the rubble, looking for items of interest. There\r\nis no sign of Gastromo, but you can add any of the following to your Rampage Sheet: a\r\nBoulder (if you don’t already have one), a Sack, a Barrel of Wine (1 Food Point), a Crate of\r\nSweetcakes (2 Food Points), a Brass Telescope (1 Loot Point), an Ebony Staff (1 Loot Point).\r\nWhen you have finished here, turn to 12.",
    "22": "You are at the Blue Crab Tavern. Tick off a Time Box. If you have ticked off five Time Boxes,\r\nturn to 50. Otherwise, you can go:\r\n         North, to the mansion of Bronze the Merchant turn to 35\r\n         East, to the market                             turn to 45",
    "23": "The forge, and many of the surrounding buildings, have all burned down, and are now little\r\nmore than blackened shells and smoking piles of ash. If there is a tick in the above box, you have\r\nBeen Here Before. Turn to 2. Otherwise, read on.\r\n        True to form, Stubbs was a miserly Dwarf, and now that his forge is no more, you\r\nspot his magical strongbox lying unburned among the ruins. Cracking it open with your\r\nweapon reveals gold and jewels beyond your feeblest imaginings! Add the Dwarven\r\nStrongbox (3 Loot Points) to your Sack, and tick the box above. Turn to 2.",
    "24": "The Curer is not the most reliable of spellcasters, especially when incandescent with rage due\r\nto the destruction of his temple. Roll one die and turn to the paragraph indicated to discover\r\nthe effect of his spell upon you:\r\n         Roll 1 to 2       turn to 31\r\n         Roll 3 to 4       turn to 16\r\n         Roll 5 to 6       turn to 34",
    "25": "If there is a tick in the above box, you have Been Here Before. Turn to 38. Otherwise, read on.\r\n           The keep of King Brilligan the Great, overlord of the Gnomes of Boulder Ford, is a\r\nsmall sturdy fortress at the north end of town. Gnomish archers armed with short bows and\r\nclad in green livery line the battlements. Pennants bearing the emblem of King Brilligan, a\r\ngrey boulder being split by a steel pick on an emerald field, flutter in the breeze from the tops\r\nof the tallest towers.\r\n           If you want to leave now, turn to 27.\r\n           If you want to assault the fortress, read on. In a fury of destruction you hurl yourself\r\nat the walls of the keep, battering them with your weapon! They were built by Dwarven\r\nstone-masons from the distant kingdom of Tuskerland and will not be easy to destroy.\r\n           Roll one die and add two (except if you have the Sword of Goff, in which case just\r\nroll one die). If it is less than your STRENGF score, tick the box above, and turn to 41. If it is\r\nequal to or greater than your STRENGF score, you fail to smash a way into the keep. Deduct\r\none point from your TUFF score to reflect both your efforts and the Gnomish arrows\r\nbouncing off your hardened hide. If your TUFF score is now zero, turn to 13.\r\n           Otherwise, try again by rolling one die and adding two (except if you have the Sword\r\nof Goff), and comparing it to your STRENGF score in the manner above. Keep doing this until\r\nyou either tear a hole through the walls of the castle, or die trying! Alternatively, you could\r\ndecide the whole thing is too much hard work and wander away from the keep. If you choose\r\nthis option, turn to 27.",
    "26": "With a howl of rage you rip aside the gates of Boulder Ford and storm into the town! Add 1\r\nChaos Point for destroying the gates.\r\n        A horde of Gnomish guards clad in green battle-leathers and armed with\r\nshortswords pour forth from the gatehouse to attack you from all sides. Standing your\r\nground, you flail about at them with your weapon. Fight the Gnomish guards as one\r\nopponent.\r\n\r\nGNOMISH GUARDS                    STRENGF 2         TUFF 6 HURT 1\r\n\r\nYou may throw a Boulder at the Gnomish guards if you have one. If the guards reduce your\r\nTUFF score to zero, turn to 13. If you want to flee, turn to 7. If you reduce the guards’ TUFF\r\nscore to zero, you have beaten most of them off, and the rest flee in panic. Add 1 Chaos Point\r\nfor annihilating the garrison of the Boulder Ford gatehouse, and turn to 7.",
    "27": "You are at Brilligan’s Keep. Tick off a Time Box. If you have ticked off five Time Boxes, turn\r\nto 50. Otherwise, you can go:\r\n         South, to the forge                     turn to 5\r\n         East, to the Workshop of Hicobemus      turn to 40\r\n         West, to Gastromo’s Tower               turn to 10",
    "28": "The mansion of Bronze the Merchant is now little more than a pile of rubble. As are many of\r\nthe homes of other traders in the area. Rampaging mobs of Gnomish looters prowl the streets,\r\nstripping valuables from the ruins.\r\n        One such gang spots you ambling down a lane. “It’s the monster!” they howl in\r\nunison. “Get ‘im, lads!”\r\n        You must fight the mob of Gnomish townsfolk, armed with clubs, spears and other\r\nmakeshift weaponry, as one opponent.\r\n\r\nGNOMISH MOB              STRENGF 2        TUFF 8 HURT 1\r\n\r\nYou may throw a Boulder at the Gnomish mob if you have one. If the mob reduces your\r\nTUFF score to zero, turn to 13. If you want to flee, turn to 47. If you reduce the mob’s TUFF\r\nscore to zero, you have beaten most of them off, and the survivors flee in fear, screaming\r\n“Run away! Run away!”\r\n        The mob has certainly uncovered plenty of interesting objects in the homes of the\r\nmerchants however. Roll one die and consult the chart below to see what they left behind.\r\n\r\nRoll 1          Roast Ox (2 Food Points)\r\nRoll 2          Cured Ham (1 Food Point)\r\nRoll 3          Barrel of Wine (1 Food Point)\r\nRoll 4          Asantian Rug (1 Loot Point)\r\nRoll 5          Silver Candelabra (1 Loot Point)\r\nRoll 6          Gold Dragon Statue (2 Loot Points)\r\n\r\nYou can add the item to your Sack if you wish. When you have finished here, turn to 47.",
    "29": "After you hit Hicobemus with your Boulder or weapon, something goes horribly wrong with\r\nthe contraption strapped to his back. The pressurized tank explodes in a fiery blast of molten\r\nslag and blazing plasma. The unfortunate alchemist is instantly vapourised, and his\r\nworkshop torn apart in a hail of bricks and stone. You also suffer serious injury from the\r\nexplosion! Roll one die and deduct the result from your TUFF score. If this reduces your\r\nTUFF score to zero, turn to 13.\r\n          Otherwise, the blast also destroys your Sack and any items it contains. Cross them all\r\noff your Rampage Sheet. If you have two Sacks, only one is destroyed - you choose which\r\none. It has no effect on your weapon or any items not in your Sack, such as a Boulder or a\r\nShield.\r\n          Still, at least you are alive. Blackened, charred, and scorched nearly to the bone, but\r\nstill alive. You search the ruins of the workshop and find a few things that were miraculously\r\nnot destroyed by the blast. Add any of the following to your Rampage Sheet: a Sack, a Brass\r\nTelescope (1 Loot Point), a Vat of Spirits (2 Food Points). In addition, add 2 Chaos Points for\r\nthe destruction caused. When you have finished here, turn to 37.",
    "30": "If there is a tick in the above box, you have Been Here Before. Turn to 43. Otherwise, read on.\r\n           The livestock pens are where the people of Boulder Ford keep much of their wealth\r\nin the form of cattle and other beasts of burden. The animals have already sensed your\r\npresence, and are becoming increasingly hysterical as they attempt to break free from the\r\ncorrals that contain them.\r\n\r\n\r\n\r\n         Suddenly, a volley of white-feathered arrows fly through the air to bury themselves\r\nin the dirt at your broad feet. They have been fired from the longbow of Beech, an Elven\r\nranger and animal rights activist. “I cannot let you have them,” she says, standing up from\r\nbehind a fence, bow drawn and ready with another arrow. “Cows have feelings too!”\r\n         If you wish to leave now, turn to 32.\r\n         Otherwise, you snarl and charge the Elf woman, who responds by firing yet more\r\narrows at you. Tick the box above and roll one die. If you roll under your SMARTS score, you\r\nshrug the arrows off and attack Beech. Turn to 39.\r\n         If you roll equal to or over your SMARTS score, some of the arrows actually pierce\r\nyour tough hide and cause not inconsiderable pain. Deduct one point from your TUFF score.\r\nIf your TUFF score is now zero, turn to 13. Otherwise, you attack the Elven ranger. Turn to 39.",
    "31": "The fiery blast of blue energy incinerates you where you stand! Roll one die and deduct the\r\nresult from your TUFF score. If this reduces your TUFF score to zero, turn to 13.\r\n          Otherwise, the blast also destroys your Sack and any items it contains. Cross them all\r\noff your Rampage Sheet. If you have two Sacks, only one is destroyed - you choose which\r\none. It has no effect on your weapon or any items not in your Sack, such as a Boulder or a\r\nShield.\r\n          Still, at least you are alive. Blackened, charred, and scorched nearly to the bone, but\r\nstill alive. Turn to 9.",
    "32": "You are at the livestock pens. Tick off a Time Box. If you have ticked off five Time Boxes, turn\r\nto 50. Otherwise, you can go:\r\n         North, to the Temple of Goff      turn to 15\r\n         West, to the market               turn to 45",
    "33": "The market is eerily silent, and strewn with the wreckage of broken stalls and shattered\r\npottery. Suddenly, a scrawny Gnome in brown leather waving a dagger, leaps out behind you\r\nand attempts to stab you in the leg, screaming “Ferret the Rogue strikes back!”\r\n        Roll one die. If you roll under your SMARTS score, you dodge the blow. If you roll\r\nequal to or over your SMARTS score, the dagger sinks painfully into the back of your calf.\r\nDeduct one point from your TUFF score. If your TUFF score is now zero, turn to 13.\r\n        Regardless, Ferret the Rogue runs away before you can catch him and grind him into\r\npulp. Turn to 42.",
    "34": "The Curer has got his spells wrong! Instead of scorching you where you stand, the blue wave\r\nof energy heals and refreshes your body and soul. If you are wounded, restore your TUFF\r\nscore to the level it was at the start of the adventure. In addition, if you are drunk or carrying\r\nSoultaker, you may also restore your SMARTS score to the level it was at the start of the\r\nadventure. Turn to 9.",
    "35": "If there is a tick in the above box, you have Been Here Before. Turn to 28. Otherwise, read on.\r\n           The mansion of Bronze the Merchant, richest Gnome in all of Boulder Ford, stands\r\namidst the less impressive dwellings of poorer traders. Its walls are made from rose-coloured\r\nmarble quarried from Smokeypeak Mountain, roofed with black timber from Doomwood\r\nForest. It was being guarded by a host of bravoes and hireswords, but most of those fled as\r\nsoon as you showed up.\r\n\r\n\r\n\r\n      In fact, only one guard remains, Ruffthug Half-troll, personal protector of Bronze the\r\nMerchant and a traitor to your peoples. He sniffs in contempt at your lumbering approach.\r\n\r\n        “By the Six Hells, don’t you lot ever take a bath?” he says, wrinkling his nose in\r\ndisgust. Hefting a razor-sharp battle-axe, Ruffthug advances purposely towards you. You\r\nmust fight the renegade Half-troll!\r\n\r\nRUFFTHUG HALF-TROLL              STRENGF 4         TUFF 5    HURT 2\r\n\r\nYou may throw a Boulder at Ruffthug if you have one. If Ruffthug reduces your TUFF score\r\nto zero, turn to 13. If you want to flee, turn to 47. If you reduce Ruffthug’s TUFF score to zero,\r\nyou have defeated Bronze the Merchant’s elite bodyguard! Tick the box above.\r\n         You are too big to enter Bronze’s mansion, but you do manage to smash a few doors,\r\nreach in with a taloned fist, and pull some choice items out into the street. Add any of the\r\nfollowing to your Sack: Barrel of Wine (1 Food Point), Roast Hog (1 Food Point), Silver\r\nCandelabra (1 Loot Point), Gilt-frame Portrait (1 Loot Point). When you are finished here,\r\nturn to 47.",
    "36": "Quickly, while the dead king’s Gnomish subjects wail and lament his violent passing, you\r\nembark on a smash and grab campaign through the most accessible parts of the keep. This\r\nmeans all the chambers adjoining the central courtyard, where you can reach in with dirty\r\nfingers and grab the treasures of the castle.\r\n         You cannot take the axe Trollslayer, it will burn your hand horribly, so you bury it\r\nunder a pile of rubble. However, you can take any of the following: a Boulder (if you don’t\r\nalready have one), a Sack, a Barrel of Wine (1 Food Point), a Roast Ox (2 Food Points), a\r\nMithril Tabard (2 Loot Points), a Silver Candelabra (1 Loot Point), a Gilt-frame Portrait (1\r\nLoot Point). When you are finished here, turn to 27.",
    "37": "You are at the Workshop of Hicobemus the Alchemist. Tick off a Time Box. If you have ticked\r\noff five Time Boxes, turn to 50. Otherwise, you can go:\r\n         South, to the Temple of Goff    turn to 15\r\n         West, to Brilligan’s Keep       turn to 25",
    "38": "The breached walls of Brilligan’s Keep lie open like the shattered shell of an enormous Land\r\nDragon. Columns of smoke rising from blackened flaming towers, and the bodies of the fallen\r\nare everywhere. Survivors from the King’s palace guard have formed a ragged militia unit,\r\nand are beating off the occasional foray by rampaging gangs of looters. On seeing you, a\r\ndetachment of militia charge noisily in your direction, screaming for bloody vengeance!\r\n        “The Destructor has returned!” they howl. “Death to the Destructor!”\r\n        You must fight the Gnomish militia as one opponent.\r\n\r\nGNOMISH RESISTANCE MILITIA                STRENGF 2         TUFF 5     HURT 1\r\n\r\nYou may throw a Boulder at the Gnomish militia if you have one. If the militia reduces your\r\nTUFF score to zero, turn to 13. If you want to flee, turn to 27. If you reduce the militia’s TUFF\r\nscore to zero, you have beaten most of them off, and one of the survivors pulls a battered\r\nhorn from his jacket and sounds the retreat with a discordant note. You see other militia units\r\n\r\n\r\n\r\nregrouping among the ruins of the keep, so you too decide to leave. As you leave, you can\r\npull a Boulder from the rubble if you do not already have one, and add it to your Rampage\r\nSheet. Turn to 27.",
    "39": "Beech drops her bow and draws a longsword. You must fight this strange Elven defender of\r\nanimals.\r\n\r\nBEECH THE ELF RANGER             STRENGF 3         TUFF 3     HURT 1\r\n\r\nYou may throw a Boulder at Beech if you have one. If Beech reduces your TUFF score to zero,\r\nturn to 13. If you want to flee, turn to 32. If you reduce Beech’s TUFF score to zero, you have\r\ndefeated the Elven ranger.\r\n         You fall greedily upon the helpless livestock, slaughtering a bull on the spot and\r\nfeasting on its still-warm flesh. Restore 2 TUFF points to your score if you are wounded. You\r\ncan also add a Cow (2 Food Points) and an Ox (2 Food Points) to your Sack if you have\r\nenough space. Your actions have broken several of the pens and the surviving animals\r\nstampede! Add 1 Chaos Point and turn to 32.",
    "40": "If there is a tick in the above box, you have Been Here Before. Turn to 48. Otherwise, read on.\r\n           The Workshop of Hicobemus the Alchemist is a most peculiar dwelling. It is built\r\ninto the Groaning Bridge, which spans a loop of the Hagfish River as it flows through the\r\nnorthern part of Boulder Ford. The Workshop is all arches and columns, full of pumps and\r\ndistillery apparatus powered by the riverís waters as it surges downstream.\r\n           A door is slammed open, and out staggers the Gnomish alchemist Hicobemus, in\r\nstained grey robes, with a patched, pointy hat upon his head, and a long filthy beard that\r\ngrows down to his feet. He’s ridiculously drunk, you can smell the reek of distilled liquor\r\nfrom up here. Of more immediate concern is the bizarre apparatus strapped to his back. It\r\nappears to be some sort of pressurized tank, with a long segmented tube connecting it to a\r\nhand-held iron wand held in Hicobemus’ right hand.\r\n           “Come on then, you bastard!” he rants at you. “I’ll have ya! Say hello to my latest\r\ninvention, I call it Dragon Breath!”\r\n           So saying he pulls a trigger on the iron wand and a jet of flame erupts from its tip,\r\nforcing you backwards. You must fight the intoxicated alchemist and his fiery secret\r\nweapon!\r\n\r\nHICOBEMUS THE ALCHEMIST                   STRENGF 2         TUFF 3    HURT 4\r\n\r\nYou may throw a Boulder at Hicobemus if you have one. If Hicobemus reduces your TUFF\r\nscore to zero, turn to 13. If you want to flee, turn to 37. The first time you wound Hicobemus\r\n(including a Boulder strike, if you threw one at him), tick the box above, and turn to 29.",
    "41": "With a primal scream of fury you tear aside the castle’s outer walls and storm into the central\r\ncourtyard! Add 3 Chaos Point for breaching the defences of Brilligan’s Keep.\r\n        Right in the middle of things organizing the resistance, is King Brilligan the Great\r\nhimself, clad in a mithril tabard, with a horned helm on his head and an iron shield on one\r\narm. Clenched in his other hand, glinting cruelly in the sun, is the dread axe Trollslayer, bane\r\nof Big Folk everywhere!\r\n\r\n\r\n\r\n        “Hold!” shouts King Brilligan, the feared axe raised aloft. “I will fight you monster in\r\nsingle combat and you will perish here, by Groff’s sacred sword!”\r\n        You become aware of an audience of Brilligan’s subjects watching the two of you\r\nexpectantly from the ruined battlements of the keep. You must fight the King of the Gnomes!\r\n\r\nKING BRILLIGAN THE GREAT                  STRENGF 4        TUFF 4 HURT 4\r\n\r\nYou may throw a Boulder at King Brilligan if you have one. If King Brilligan reduces your\r\nTUFF score to zero, turn to 13. If you want to flee, turn to 27. If you have reduced Brilligan’s\r\nTUFF score to zero, you have slain the King of Boulder Ford! Add 3 Chaos Points for your\r\nincredible victory over a foe long-hated by the Big Folk, and turn to 36.",
    "42": "You are in the market place of Boulder Ford. Tick off a Time Box. If you have ticked off five\r\nTime Boxes, turn to 50. Otherwise, you can go:\r\n       North, to the forge              turn to 5\r\n       South, to the gate               turn to 1\r\n       East, to the livestock pens      turn to 30\r\n       West, to the Blue Crab Tavern turn to 20",
    "43": "In all the chaos a pack of underfed dogs have needed little encouragement to go feral, and are\r\nnow feasting on the carcasses of several dead cattle. Seeing you as fellow competition, they\r\nattack in a flurry of snarls and bared fangs. Fight them as one opponent.\r\n\r\nFERAL DOG PACK                   STRENGF 2         TUFF 4 HURT 1\r\n\r\nYou may throw a Boulder at the dog pack if you have one. If the dog pack reduces your TUFF\r\nscore to zero, turn to 13. If you want to flee, turn to 32. If you reduce the dog pack’s TUFF\r\nscore to zero, you have beaten most of them off, and the rest slink away with their tails\r\nbetween their legs. Turn to 32.",
    "44": "Still flush with success from your recent conquest, you begin smashing holes in the domed\r\nroof of the Temple of Goff, looking for treasure. This enrages the high priest, a decrepit old\r\nbalding Gnome in a scarlet robe, known as the Curer. He rushes out of the temple in a fury,\r\nfrothing at the mouth and yelling near-incomprehensible obscenities at you.\r\n          The Curer then waves a gnarled staff in the air and begins to pronounce a mystical\r\nchant. A glowing blue nimbus of light surrounds him, and as his prayers reach a screaming\r\ncrescendo, he makes a stabbing gesture with the staff, pointing it directly at you. Blue light\r\nraces down the priest’s arm, along the staff, and arcs through the air towards you in a blast of\r\ndivine energy.\r\n          You have been ensorcelled by the Curer! Roll one die.\r\n          If you roll under your SMARTS score, you shrug off the effects of the spell. Turn to 9.\r\n          If you roll equal to or over your SMARTS score, you are now the victim of unknown\r\nsorcery! Turn to 24.",
    "45": "If there is a tick in the above box, you have Been Here Before. Turn to 33. Otherwise, read on.\r\n           The market is in an uproar owing to your intrusion. Stall-holders are frantically\r\nshutting up shop, people are rushing all over the place, pack-animals are milling around in\r\n\r\n\r\n\r\nconfusion, and Gnomish guards are everywhere trying to maintain order. You leisurely\r\ncontemplate the rich pickings on offer, but one lone figure stands in your way. Roll one die to\r\ndetermine who:\r\n\r\nRoll 1 or 2     SOURNOSE THE GUARD                 STRENGF 3        TUFF 2 HURT 1\r\nRoll 3 or 4     FATBELLY THE GUARD                 STRENGF 2        TUFF 3 HURT 1\r\nRoll 5 or 6     A DANCING BEAR                     STRENGF 3        TUFF 5 HURT 2\r\n\r\nYou may throw a Boulder at your opponent if you have one. If your opponent reduces your\r\nTUFF score to zero, turn to 13. If you want to flee, turn to 42. If you reduce your opponent’s\r\nTUFF score to zero, you stand triumphant amidst the ruins of the market place. Tick the box\r\nabove, and add 1 Chaos Point.\r\n        You strip the market of a few choice items, add a Barrel of Sausages (1 Food Point)\r\nand an Asantian Rug (1 Loot Point) to your Sack. When you have finished here, turn to 42.",
    "46": "The fiery blast of blue energy incinerates you where you stand! Roll one die and deduct the\r\nresult from your TUFF score. If this reduces your TUFF score to zero, turn to 13.\r\n         Otherwise, the blast also destroys your Sack and any items it contains. Cross them all\r\noff your Rampage Sheet. If you have two Sacks, only one is destroyed, you choose which one.\r\nIt has no effect on your weapon or any items not in your Sack, such as a Boulder or a Shield.\r\n\r\n          Still, at least you are alive. Blackened, charred, and scorched nearly to the bone, but\r\nstill alive. Gastromo meanwhile, has used the diversion to waddle back into his tower and\r\nspell-lock the door. You can:\r\n          Assault the tower                   turn to 18\r\n          Leave the area                      turn to 12",
    "47": "You are at the mansion of Bronze the Merchant. Tick off a Time Box. If you have ticked off\r\nfive Time Boxes, turn to 50. Otherwise, you can go:\r\n        North, to Gastromo’s Tower       turn to 10\r\n        South, to the Blue Crab Tavern turn to 20\r\n        East, to the forge               turn to 5",
    "48": "The Workshop of Hicobemus, and indeed much of the Groaning Bridge, is little more that a\r\nsteaming pile of rubble lying in the middle of the Hagfish River. A prolonged search of the\r\ndebris turns up nothing apart from one of the following, which you may add to your\r\nRampage Sheet:\r\n\r\nRoll 1 or 2     A Cured Ham (1 Food Point)\r\nRoll 3 or 4     A Keg of Beer (1 Food Point)\r\nRoll 5 or 6     A Potion of Healing (see below)\r\n\r\nIf you find a Potion of Healing, it needs to be kept in a Sack if you have one, or you can drink\r\nit now. Drinking it now will restore your TUFF score to its original level at the start of this\r\nadventure. When you have finished here, turn to 37.",
    "49": "The tower of Gastromo the Wizard is now little more than a heap of white rubble, from which\r\nemanates wisps of sulphurous yellow smoke. You scrabble about in the debris looking for\r\n\r\n\r\n\r\nvaluables, but succeed only in freeing a demon that must have previously been bound in\r\nGastromo’s cellar! It shoots up into the sky, hanging in the air above you, and taking the form\r\nof a bulky bat-winged ape with red skin and goat-like horns.\r\n         “Haha! Free at last!” it howls with demonic glee, before spotting you. “Yes, you’ll do!\r\nI need to harvest souls for the Dark Master!” Waving a rusty barbed trident in your direction,\r\nthe Pit Demon swoops down on black wings to attack.\r\n\r\nPIT DEMON       STRENGF 4         TUFF 4 HURT 2\r\n\r\nYou may throw a Boulder at the Pit Demon if you have one. If the Pit Demon reduces your\r\nTUFF score to zero, turn to 13. If you want to flee, turn to 12. If you have the Sword of Goff,\r\nyou may add 1 point to your STRENGF score when fighting the Pit Demon. If you reduce the\r\nPit Demon’s TUFF score to zero, you have slain the foul hellspawn and banished it back to the\r\nSix Hells! It leaves behind a giant glowing ruby, add the Demon Gem (2 Loot Points) to your\r\nSack if you wish. Hurriedly, you leave the area to avoid disturbing any more supernatural\r\nfiends. Turn to 12.\r\n         However, if you have already fought one Pit Demon, then there is nothing more for\r\nyou here. Turn to 12.",
    "50": "You think you’ve spent enough time sacking and looting the town of Boulder Ford, and\r\ndecide to return to your cave and take stock of the booty you’ve acquired. Besides, King\r\nYalamon of the Southlands has a garrison nearby, and you’ll be damned to the Six Hells if\r\nyou are still stuck here when his crack legions show up!\r\n        Back in your humble lair, you empty out the contents of your Sack(s) and recount\r\nyour exploits. Consult your Rampage Sheet, and add up all your Chaos Points, Loot Points,\r\nand Food Points into one total score. This total is the number of Rampage Points you\r\nachieved for this adventure. Compare your Rampage Points total to the chart below to see\r\nhow well you did when you went on a RAMPAGE!\r\n\r\n        0-5     Carpet-bagger!             You need practice at this looting malarkey!\r\n                                           Your feeble endeavours have been laughed off by\r\n                                           both your beast colleagues and your townsfolk foes\r\n                                           as the turgid scratchings of a rank amateur. You\r\n                                           need to embrace your inner monster and really cut\r\n                                           loose in an orgy of senseless destruction.\r\n\r\n        6-10    Robber!                    Well, you caused a bit of havoc, but it was nuisance\r\n                                           value more than anything else. Perhaps you will\r\n                                           inspire some callow farmer’s son to seek his fame\r\n                                           and fortune by slaying you with a rusty blunderbuss.\r\n                                           Your exploits are hardly the stuff of legend however,\r\n                                           and you should try harder next time!\r\n\r\n        11-15   Marauder!                  Not a bad start to your rampaging career,\r\n                                           but you still could do better. The evil warlord\r\n                                           Malthus Fire wants you as a trusted sidekick for his\r\n                                           dungeon lair. This is a bad thing though, because it\r\n                                           means he doesn’t consider you a threat, and that\r\n                                           shows disrespect to your inner monster. Pull your\r\n                                           leather breeches up and swing that weapon a bit\r\n                                           harder!\r\n\r\n\r\n\r\n16-20   Destroyer!               A good solid beginning to a (hopefully) long\r\n                                 life of looting and pillaging. You’ve done well. So\r\n                                 well in fact, that a small band of beginning\r\n                                 adventurers formed amidst the ruins of Boulder\r\n                                 Ford following your rampage, with the express\r\n                                 purpose of bringing you down! They consider you\r\n                                 their arch-nemesis…\r\n21-25   Obliterator!             You’ve done very well in your rampaging,\r\n                                 and are capable of wasting an entire town without\r\n                                 much trouble. But your card is marked now! With\r\n                                 your reputation being what it is, it won’t be long\r\n                                 before there is a long line of famed hireswords and\r\n                                 sorcerous spellslingers beating the well-worn path to\r\n                                 your lair. Be warned…\r\n26+     Annihilator!             You are the master of devastation! Your\r\n                                 name is whispered throughout the lands of\r\n                                 Gallansia as a despoiler without compare,by both\r\n                                 fellow monsters and glory-seeking adventurers.\r\n                                 Actually, that’s the downside. King Yalamon has\r\n                                 heard of your exploits and sent out the call for\r\n                                 legendary heroes everywhere to slay you and protect\r\n                                 the land from evil. Therein lies another tale…"
}
