{
  "1": {
    "text": "The gates of Boulder Ford are made of thick oak reinforced with iron bands, and set within a sturdy stone gatehouse. Still, that should pose little problem to a determined beast such as yourself. Ignoring the shouts and screams of the Gnomish guards, you proceed to wrench the gates apart. Roll one die. Alternatvely you could decide the whole thing is too much hard work and wander back to your cave. If you decide to do this, turn to 50.",
    "conditionnals": {
      "already_passed": {
        "times": 1,
        "goto": {
          "id_section": 14,
          "impact": {
            "stats": [],
            "inventory": {}
          }
        }
      },
      "dice": {
        "message": "you try to open the gates",
        "operators": {
          ">=": {
            "stat": "force",
            "then": {
              "goto": {
                "id_section": 26,
                "impact": {
                  "stats": [],
                  "inventory": {}
                }
              },
              "message": "you open the gates"
            }
          },
          "<": {
            "stat": "force",
            "then": {
              "goto": {
                "id_section": 13,
                "impact": {
                  "stats": [],
                  "inventory": {}
                }
              },
              "message": "gnomes fire arrows at you"
            }
          }
        }
      }
    }
  },
  "2": {
    "text": "You can go: North, to Brilligan's Keep turn to 25 South, to the market turn to 45 East, to the Temple of Goff turn to 15 West, to the mansion of Bronze the Merchant turn to 35",
    "conditionnals": {
      "already_passed": {
        "times": 5,
        "goto": {
          "id_section": 14,
          "impact": {
            "stats": [],
            "inventory": {}
          }
        }
      },
      "dice": {}
    }
  },
  "3": {
    "text": "The Blue Crab Tavern looks like it has been ransacked by a mob of green-skinned Gorks.  The innkeeper, a fat red-faced Gnome called Vaed Thol, sits weeping on a keg outside the ruins of his tavern. On seeing you return, he rises to his feet waving a chair leg menacingly in your direction. \"You heartless bastard!\" Vaed howls. \"I was going to sell the place and retire to a bamboo beach hut on Skull Island. I'll make you pay for this!\" Defend yourself against the irate barman. If you want to flee, turn to 22.",
    "conditionnals": {
      "already_passed": {
        "times": 1,
        "goto": {
          "id_section": 22,
          "impact": {
            "stats": [],
            "inventory": {}
          }
        }
      },
      "dice": {
        "message": "throw a Boulder at Vaed",
        "operators": {
          ">=": {
            "stat": "force",
            "then": {
              "goto": {
                "id_section": 22,
                "impact": {
                  "stats": [],
                  "inventory": {}
                }
              },
              "message": "sucess"
            }
          },
          "<": {
            "stat": "force",
            "then": {
              "goto": {
                "id_section": 13,
                "impact": {
                  "stats": [],
                  "inventory": {}
                }
              },
              "message": "You miss"
            }
          }
        }
      }
    }
  },
  "4": {
    "text": "Gastromo wipes his free hand on the hem of his robe, and after reaching into a pocket, scatters a fistful of tiny teeth upon the ground. In a moment, the magical blue light has transformed every tooth into a short, brown-skinned Yobbo, which are highly carnivorous humanoids related to Gorks. Lacking weapons, the horde of Yobbos hurl themselves at you in a great scaly wave, biting at your calves and gnawing on your kneecaps. If you want to flee, turn to 12.",
    "conditionnals": {
      "already_passed": {},
      "dice": {
        "message": "fight the Yobbos",
        "operators": {
          ">=": {
            "stat": "force",
            "then": {
              "goto": {
                "id_section": 18,
                "impact": {
                  "stats": [],
                  "inventory": {}
                }
              },
              "message": "Gastromo meanwhile, has used the diversion to waddle back into his tower and spell-lock the door. You assault the tower"
            }
          },
          "<": {
            "stat": "force",
            "then": {
              "goto": {
                "id_section": 13,
                "impact": {
                  "stats": [],
                  "inventory": {}
                }
              },
              "message": "You loose"
            }
          }
        }
      }
    }
  },
  "5": {
    "text": "The forge of Boulder Ford is a stout stone-walled building with a tall smoking chimney. Mirroring the latter is the Dwarven smith Stubbs, who stands proudly outside his workplace puffing on a pipe and leaning on a warhammer. \"Was wondering when you were going to show up,\" he says, blowing smoke rings into the sky. \"Need the practice. Haven't slain any of your kind in years.\" Enraged by the smith's words and nonchalant attitude you howl a battle-cry and attack! If you want to flee, turn to 2.",
    "conditionnals": {
      "already_passed": {
        "times": 1,
        "goto": {
          "id_section": 23,
          "impact": {
            "stats": [],
            "inventory": {}
          }
        }
      },
      "dice": {
        "message": "throw a Boulder at Stubbs",
        "operators": {
          ">=": {
            "stat": "force",
            "then": {
              "goto": {
                "id_section": 19,
                "impact": {
                  "stats": [],
                  "inventory": {}
                }
              },
              "message": "you have slain the insolent Dwarf"
            }
          },
          "<": {
            "stat": "force",
            "then": {
              "goto": {
                "id_section": 13,
                "impact": {
                  "stats": [],
                  "inventory": {}
                }
              },
              "message": "You miss"
            }
          }
        }
      }
    }
  },
  "6": {
    "text": "You crack open one of the kegs to test that it's \"still fresh\". Draining it in one long gulp, you throw the keg aside and open another, finishing it just as quickly. Ysou been wasting time sitting here drinking. Hic! and turn to 22.",
    "conditionnals": {
      "already_passed": {
        "times": 5,
        "goto": {
          "id_section": 50,
          "impact": {
            "stats": [],
            "inventory": {}
          }
        }
      },
      "dice": {}
    }
  },
  "7": {
    "text": "You are at the gates of Boulder Ford. You can go: North, to the market turn to 45 South, to your cave turn to 50",
    "conditionnals": {
      "already_passed": {
        "times": 5,
        "goto": {
          "id_section": 50,
          "impact": {
            "stats": [],
            "inventory": {}
          }
        }
      },
      "dice": {}
    }
  },
  "8": {
    "text": "The Temple of Goff lies in ruins, the statue of the god now little more than a pile of rocks. \"Iconoclast! Despoiler! Destroyer! I curse you for returning to the scene of your blasphemous crimes!\" moans the ravaged head of the statue of Goff from amidst the rubble.",
    "conditionnals": {
      "already_passed": {},
      "dice": {
        "message": "throw a Boulder at Vaed",
        "operators": {
          ">=": {
            "stat": "intelligence",
            "then": {
              "goto": {
                "id_section": 17,
                "impact": {
                  "stats": [],
                  "inventory": {}
                }
              },
              "message": "you have been cursed!"
            }
          },
          "<": {
            "stat": "intelligence",
            "then": {
              "goto": {
                "id_section": 17,
                "impact": {
                  "stats": [],
                  "inventory": {}
                }
              },
              "message": "you are immune to the effects of the statue's curse"
            }
          }
        }
      }
    }
  },
  "9": {
    "text": "Enough with the sorcery! Now is the time to smite this old Gnomish priest and grind his bones into the dirt! Resigning himself to his fate, the Curer casts one last spell that covers him in a glittering panoply of golden sparks that enervates him somewhat, and advances slowly towards you brandishing his staff. If you want flee, turn to 17.",
    "conditionnals": {
      "already_passed": {},
      "dice": {
        "message": "throw a Boulder",
        "operators": {
          ">=": {
            "stat": "force",
            "then": {
              "goto": {
                "id_section": 17,
                "impact": {
                  "stats": [],
                  "inventory": {}
                }
              },
              "message": "you crush the irritating priest underfoot, and continue ransacking the Temple of Goff. By the careful act of smashing the roof-dome and reaching inside"
            }
          },
          "<": {
            "stat": "force",
            "then": {
              "goto": {
                "id_section": 13,
                "impact": {
                  "stats": [],
                  "inventory": {}
                }
              },
              "message": "fail"
            }
          }
        }
      }
    }
  },
  "10": {
    "text": "Gastromo's Tower stands like a white fang looming above the Gnomish dwellings of Boulder Ford. Gastromo is a human spellcaster who is good friends with King Brilligan of the Gnomes, and has lived in the town for decades. Some say Gastromo's price for helping to defend Boulder Ford is an unlimited tab at the local bakery. Suddenly the thick door at the base of the tower is thrown open! The fat wizard himself, azure robes straining from containing his enormous bulk, comes shambling out, wiping crumbs from his long white beard and licking his fingers clean. He points one hand at you, makes a series of arcane gestures, and, still with a mouthful of food, mutters something unintelligible. Instantly, the air around you is filled with a glowing blue flash of light. Gastromo has cast a spell upon you!",
    "conditionnals": {
      "already_passed": {
        "times": 1,
        "goto": {
          "id_section": 18,
          "impact": {
            "stats": [],
            "inventory": {}
          }
        }
      },
      "dice": {
        "message": "you try to open the gates",
        "operators": {
          "=": {
            "stat": "resistance",
            "then": {
              "goto": {
                "id_section": 16,
                "impact": {
                  "stats": [],
                  "inventory": {}
                }
              }
            }
          },
          "<": {
            "stat": "resistance",
            "then": {
              "goto": {
                "id_section": 46,
                "impact": {
                  "stats": [],
                  "inventory": {}
                }
              }
            }
          },
          ">": {
            "stat": "resistance",
            "then": {
              "goto": {
                "id_section": 4,
                "impact": {
                  "stats": [],
                  "inventory": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "11": {
    "text": "The Blue Crab Tavern lies undefended and at your mercy! Of course, you're too big to enter the place, but you stick an arm through a window and scrabble around for barrels or kegs to grab. Roll one die. If you roll under your SMARTS score, add a Keg of Beer (1 Food Point) to your Sack, and turn to 22. If you roll equal to or over your SMARTS score, you pull out a keg of beer, and then another, and then another…turn to 6."
  },
  "12": {
    "text": "You are at the tower of Gastromo the Wizard. Tick off a Time Box. If you have ticked off five Time Boxes, turn to 50. Otherwise, you can go: South, to the mansion of Bronze the Merchant turn to 35 East, to Brilligan's Keep turn to 25"
  },
  "13": {
    "text": "You are dead! You have perished in your lone assault on Boulder Ford. As in any game however, the only proper response to failure is to try harder! Choose another monster (or create your own using the rules on page 25), fill in the appropriate details on a new Rampage Sheet, and turn to 1."
  },
  "14": {
    "text": "The gates of Boulder Ford have been torn from their hinges and the garrison of guards have long since fled. If there is a tick in the above box, you have Been Here Before. Turn to 7. Otherwise, read on. \"Flippin' heck!\" mutters a female human adventurer who has just wandered into town through the ruined archway. \"All I wanted was a hot bath and a soft bed! I am Vaitharre the Adventuress, and I will not be denied!\" Unsheathing a magical sword that glows with emerald flames, she attacks you with speed and precision. Defend yourself! VAITHARRE THE ADVENTURESS STRENGF 3 TUFF 4 HURT 2 You may throw a Boulder at Vaitharre if you have one. If Vaitharre reduces your TUFF score to zero, turn to 13. If you want to flee, turn to 7. If you reduce Vaitharre's TUFF score to zero, you have slain the adventuress. Tick the box above. If you want, you can add her Fire Sword (2 Loot Points) to your Sack (as it is too small for you to use, except perhaps as a flaming toothpick). When you have finished here, turn to 7."
  },
  "15": {
    "text": "If there is a tick in the above box, you have Been Here Before. Turn to 8. Otherwise, read on. The Temple of Goff is the most important religious edifice in the Shrine District of Boulder Ford. Goff is the patron earth god of the Gnomes, and the enormous stone statue of him outside the temple depicts Goff as a muscular, serious-looking Gnome with spiky hair and beard, black robes, and a huge steel broadsword. Even as you look on, the statue suddenly comes to life, and clambers down from its plinth! As it stomps towards you on legs of rock, waving the great sword about in murderous fashion, you realize with horror that it is just about as tall as you are. \"Desecrator! Prepare to pay for your sins!\" it intones in a thunderous voice. \"Those who defile the Temple the Goff face certain death!\" You must fight the statue of the earth god in a titanic combat that shakes the very ground itself! STATUE OF GOFF STRENGF 5 TUFF 4 HURT 3 You may throw a Boulder at the statue if you have one. If the statue reduces your TUFF score to zero, turn to 13. If you want to flee, turn to 17. If you reduce the statue's TUFF score to zero, you have defeated the avatar of Goff! Tick the box above, and add 2 Chaos Points for your glorious victory! The statue is now little more than a pile of boulder-sized rubble. In fact, you can add a Boulder to your Rampage Sheet if you don't already have one. You can also take the statue's weapon, this is the legendary Sword of Goff (HURT 3)! If you choose to do this, add the Sword of Goff to your Rampage Sheet and cross off your original weapon, as you cannot carry two weapons the same time. When you have finished here, turn to 44."
  },
  "16": {
    "text": "Glowing blue chains of scorching electrical energy surround you in a crackling prison. The sorcery rends a hole in space, and, in the blink of an eye, teleports you away from your current location to another part of the town. Roll one die and turn to the paragraph indicated to discover which area of Boulder Ford you have been zapped into: Roll 1 or 2 turn to 20 Roll 3 or 4 turn to 25 Roll 5 or 6 turn to 40"
  },
  "17": {
    "text": "You are at the Temple of Goff. Tick off a Time Box. If you have ticked off five Time Boxes, turn to 50. Otherwise, you can go: North, to the Workshop of Hicobemus turn to 40 South, to the livestock pens turn to 30 West, to the forge turn to 5"
  },
  "18": {
    "text": "If there is a tick in the above box, you have Been Here Before. Turn to 49. Otherwise, read on. Gastromo's white-walled tower sits spell-tight and magically locked. It will take an immense effort to break through its defences. If you do not wish to do this and want to head elsewhere, turn to 12. If you want to attempt to flatten the tower, roll one die and add one (except if you have the Sword of Goff, in which case just roll one die). If the result is less than your STRENGF score, tick the box above, and turn to 21. If the result is equal to or greater than your STRENGF score, you fail to raze the tower. Deduct one point from your TUFF score to reflect your strenuous exertion against the tower's defensive enchantments. If your TUFF score is now zero, turn to 13. Otherwise, try again by rolling one die and adding one (except if you have the Sword of Goff), and comparing it to your STRENGF score in the manner above. Keep doing this until you either obliterate the tower, or die trying! Alternatively, you could decide the whole thing is too much hard work and wander somewhere else. If you decide to do this, turn to 12."
  },
  "19": {
    "text": "You ransack the forge by lifting the roof off the building, and reach inside with a grubby fist. Most of its contents are useless, but you can add a Boulder to your Rampage Sheet if you don't already have one. You also find a Shield that is big enough for you to use. If you are wounded, whether in combat or by a spell or an explosion, roll one die. On a roll of a 1, the Shield blocks the blow and you suffer no damage. Add the Shield to your Rampage Sheet if you wish to take it. Unfortunately, you knock over a barrel of pitch, which spills into the fireplace, and before long the entire forge is ablaze with roaring flames. Add 2 Chaos Points for all the damage caused, and roll one die. If you roll under your SMARTS score, you manage to avoid the flames. Turn to 2. If you roll equal to or over your SMARTS score, deduct 1 point from your TUFF score due to the burns you suffer in the process. If your TUFF score is now zero, turn to 13. Otherwise, turn to 2."
  },
  "20": {
    "text": "If there is a tick in the above box, you have Been Here Before. Turn to 3. Otherwise, read on. The Blue Crab Tavern sits atop a grassy rise overlooking the market, and as you stomp up the path towards it, most of the patrons flee out the back and away to the north. One figure remains, a tall muscular human holding a dark-bladed sword. It is none other than Yadda Blackhead, an albino warrior with a bad skin complexion. His magical blade Soultaker is sentient and reputed to steal the spirits of those it wounds. \"Every bloody time!\" he rants at you. \"Can't you monsters give me a moment's peace? All I want is a quiet afternoon quaffing ale and carousing with tavern wenches, but, no, you have to decide to attack Boulder Ford today…\" \"Could be worse,\" adds Soultaker in a metallic voice. \"At least it's not Malthus Fire, seeking revenge for that time with his wife Delectia when you…\" \"Silence!' screams Yadda, charging towards you, waving the talkative sword. You must fight one of the greatest heroes in all Gallansia! YADDA BLACKHEAD STRENGF 4 TUFF 4 HURT 2 You may throw a Boulder at Yadda if you have one. Every time Yadda wounds you, you must deduct 2 points from your TUFF score and add them to Yadda's TUFF score as Soultaker leeches away your vital energies. If Yadda reduces your TUFF score to zero, turn to 13. If you want to flee, turn to 22. If you reduce Yadda's TUFF score to zero, you have triumphed over one of Gallansia's selected scions of glory! Tick the box above, and add 1 Chaos Point for your epic victory. If you want, you may add Soultaker (3 Loot Points) to your Sack as it's too small for you to use as a weapon. However, you must reduce your SMARTS score by 1 (unless it is 2 already it can't go any lower!), as the blade's constant prattling gets on your nerves (\"What? No! Don't put me in there! By Vulang, what are these horrible stains?\" And so on…). When you have finished here, turn to 11."
  },
  "21": {
    "text": "You succeed in toppling the tower of Gastromo the Wizard, despite whatever magic he had enchanted his dwelling with! With a long inhuman groan, the whole structure collapses in on itself, raising a huge cloud of white dust. Add 1 Chaos Point. Coughing and retching, you pick over the rubble, looking for items of interest. There is no sign of Gastromo, but you can add any of the following to your Rampage Sheet: a Boulder (if you don't already have one), a Sack, a Barrel of Wine (1 Food Point), a Crate of Sweetcakes (2 Food Points), a Brass Telescope (1 Loot Point), an Ebony Staff (1 Loot Point). When you have finished here, turn to 12."
  },
  "22": {
    "text": "You are at the Blue Crab Tavern. Tick off a Time Box. If you have ticked off five Time Boxes, turn to 50. Otherwise, you can go: North, to the mansion of Bronze the Merchant turn to 35 East, to the market turn to 45"
  },
  "23": {
    "text": "The forge, and many of the surrounding buildings, have all burned down, and are now little more than blackened shells and smoking piles of ash. If there is a tick in the above box, you have Been Here Before. Turn to 2. Otherwise, read on. True to form, Stubbs was a miserly Dwarf, and now that his forge is no more, you spot his magical strongbox lying unburned among the ruins. Cracking it open with your weapon reveals gold and jewels beyond your feeblest imaginings! Add the Dwarven Strongbox (3 Loot Points) to your Sack, and tick the box above. Turn to 2."
  },
  "24": {
    "text": "The Curer is not the most reliable of spellcasters, especially when incandescent with rage due to the destruction of his temple. Roll one die and turn to the paragraph indicated to discover the effect of his spell upon you: Roll 1 to 2 turn to 31 Roll 3 to 4 turn to 16 Roll 5 to 6 turn to 34"
  },
  "25": {
    "text": "If there is a tick in the above box, you have Been Here Before. Turn to 38. Otherwise, read on. The keep of King Brilligan the Great, overlord of the Gnomes of Boulder Ford, is a small sturdy fortress at the north end of town. Gnomish archers armed with short bows and clad in green livery line the battlements. Pennants bearing the emblem of King Brilligan, a grey boulder being split by a steel pick on an emerald field, flutter in the breeze from the tops of the tallest towers. If you want to leave now, turn to 27. If you want to assault the fortress, read on. In a fury of destruction you hurl yourself at the walls of the keep, battering them with your weapon! They were built by Dwarven stone-masons from the distant kingdom of Tuskerland and will not be easy to destroy. Roll one die and add two (except if you have the Sword of Goff, in which case just roll one die). If it is less than your STRENGF score, tick the box above, and turn to 41. If it is equal to or greater than your STRENGF score, you fail to smash a way into the keep. Deduct one point from your TUFF score to reflect both your efforts and the Gnomish arrows bouncing off your hardened hide. If your TUFF score is now zero, turn to 13. Otherwise, try again by rolling one die and adding two (except if you have the Sword of Goff), and comparing it to your STRENGF score in the manner above. Keep doing this until you either tear a hole through the walls of the castle, or die trying! Alternatively, you could decide the whole thing is too much hard work and wander away from the keep. If you choose this option, turn to 27."
  },
  "26": {
    "text": "With a howl of rage you rip aside the gates of Boulder Ford and storm into the town! Add 1 Chaos Point for destroying the gates. A horde of Gnomish guards clad in green battle-leathers and armed with shortswords pour forth from the gatehouse to attack you from all sides. Standing your ground, you flail about at them with your weapon. Fight the Gnomish guards as one opponent. GNOMISH GUARDS STRENGF 2 TUFF 6 HURT 1 You may throw a Boulder at the Gnomish guards if you have one. If the guards reduce your TUFF score to zero, turn to 13. If you want to flee, turn to 7. If you reduce the guards' TUFF score to zero, you have beaten most of them off, and the rest flee in panic. Add 1 Chaos Point for annihilating the garrison of the Boulder Ford gatehouse, and turn to 7."
  },
  "27": {
    "text": "You are at Brilligan's Keep. Tick off a Time Box. If you have ticked off five Time Boxes, turn to 50. Otherwise, you can go: South, to the forge turn to 5 East, to the Workshop of Hicobemus turn to 40 West, to Gastromo's Tower turn to 10"
  },
  "28": {
    "text": "The mansion of Bronze the Merchant is now little more than a pile of rubble. As are many of the homes of other traders in the area. Rampaging mobs of Gnomish looters prowl the streets, stripping valuables from the ruins. One such gang spots you ambling down a lane. \"It's the monster!\" they howl in unison. \"Get 'im, lads!\" You must fight the mob of Gnomish townsfolk, armed with clubs, spears and other makeshift weaponry, as one opponent. GNOMISH MOB STRENGF 2 TUFF 8 HURT 1 You may throw a Boulder at the Gnomish mob if you have one. If the mob reduces your TUFF score to zero, turn to 13. If you want to flee, turn to 47. If you reduce the mob's TUFF score to zero, you have beaten most of them off, and the survivors flee in fear, screaming \"Run away! Run away!\" The mob has certainly uncovered plenty of interesting objects in the homes of the merchants however. Roll one die and consult the chart below to see what they left behind. Roll 1 Roast Ox (2 Food Points) Roll 2 Cured Ham (1 Food Point) Roll 3 Barrel of Wine (1 Food Point) Roll 4 Asantian Rug (1 Loot Point) Roll 5 Silver Candelabra (1 Loot Point) Roll 6 Gold Dragon Statue (2 Loot Points) You can add the item to your Sack if you wish. When you have finished here, turn to 47."
  },
  "29": {
    "text": "After you hit Hicobemus with your Boulder or weapon, something goes horribly wrong with the contraption strapped to his back. The pressurized tank explodes in a fiery blast of molten slag and blazing plasma. The unfortunate alchemist is instantly vapourised, and his workshop torn apart in a hail of bricks and stone. You also suffer serious injury from the explosion! Roll one die and deduct the result from your TUFF score. If this reduces your TUFF score to zero, turn to 13. Otherwise, the blast also destroys your Sack and any items it contains. Cross them all off your Rampage Sheet. If you have two Sacks, only one is destroyed - you choose which one. It has no effect on your weapon or any items not in your Sack, such as a Boulder or a Shield. Still, at least you are alive. Blackened, charred, and scorched nearly to the bone, but still alive. You search the ruins of the workshop and find a few things that were miraculously not destroyed by the blast. Add any of the following to your Rampage Sheet: a Sack, a Brass Telescope (1 Loot Point), a Vat of Spirits (2 Food Points). In addition, add 2 Chaos Points for the destruction caused. When you have finished here, turn to 37."
  },
  "30": {
    "text": "If there is a tick in the above box, you have Been Here Before. Turn to 43. Otherwise, read on. The livestock pens are where the people of Boulder Ford keep much of their wealth in the form of cattle and other beasts of burden. The animals have already sensed your presence, and are becoming increasingly hysterical as they attempt to break free from the corrals that contain them. Suddenly, a volley of white-feathered arrows fly through the air to bury themselves in the dirt at your broad feet. They have been fired from the longbow of Beech, an Elven ranger and animal rights activist. \"I cannot let you have them,\" she says, standing up from behind a fence, bow drawn and ready with another arrow. \"Cows have feelings too!\" If you wish to leave now, turn to 32. Otherwise, you snarl and charge the Elf woman, who responds by firing yet more arrows at you. Tick the box above and roll one die. If you roll under your SMARTS score, you shrug the arrows off and attack Beech. Turn to 39. If you roll equal to or over your SMARTS score, some of the arrows actually pierce your tough hide and cause not inconsiderable pain. Deduct one point from your TUFF score. If your TUFF score is now zero, turn to 13. Otherwise, you attack the Elven ranger. Turn to 39."
  },
  "31": {
    "text": "The fiery blast of blue energy incinerates you where you stand! Roll one die and deduct the result from your TUFF score. If this reduces your TUFF score to zero, turn to 13. Otherwise, the blast also destroys your Sack and any items it contains. Cross them all off your Rampage Sheet. If you have two Sacks, only one is destroyed - you choose which one. It has no effect on your weapon or any items not in your Sack, such as a Boulder or a Shield. Still, at least you are alive. Blackened, charred, and scorched nearly to the bone, but still alive. Turn to 9."
  },
  "32": {
    "text": "You are at the livestock pens. Tick off a Time Box. If you have ticked off five Time Boxes, turn to 50. Otherwise, you can go: North, to the Temple of Goff turn to 15 West, to the market turn to 45"
  },
  "33": {
    "text": "The market is eerily silent, and strewn with the wreckage of broken stalls and shattered pottery. Suddenly, a scrawny Gnome in brown leather waving a dagger, leaps out behind you and attempts to stab you in the leg, screaming \"Ferret the Rogue strikes back!\" Roll one die. If you roll under your SMARTS score, you dodge the blow. If you roll equal to or over your SMARTS score, the dagger sinks painfully into the back of your calf. Deduct one point from your TUFF score. If your TUFF score is now zero, turn to 13. Regardless, Ferret the Rogue runs away before you can catch him and grind him into pulp. Turn to 42."
  },
  "34": {
    "text": "The Curer has got his spells wrong! Instead of scorching you where you stand, the blue wave of energy heals and refreshes your body and soul. If you are wounded, restore your TUFF score to the level it was at the start of the adventure. In addition, if you are drunk or carrying Soultaker, you may also restore your SMARTS score to the level it was at the start of the adventure. Turn to 9."
  },
  "35": {
    "text": "If there is a tick in the above box, you have Been Here Before. Turn to 28. Otherwise, read on. The mansion of Bronze the Merchant, richest Gnome in all of Boulder Ford, stands amidst the less impressive dwellings of poorer traders. Its walls are made from rose-coloured marble quarried from Smokeypeak Mountain, roofed with black timber from Doomwood Forest. It was being guarded by a host of bravoes and hireswords, but most of those fled as soon as you showed up. In fact, only one guard remains, Ruffthug Half-troll, personal protector of Bronze the Merchant and a traitor to your peoples. He sniffs in contempt at your lumbering approach. \"By the Six Hells, don't you lot ever take a bath?\" he says, wrinkling his nose in disgust. Hefting a razor-sharp battle-axe, Ruffthug advances purposely towards you. You must fight the renegade Half-troll! RUFFTHUG HALF-TROLL STRENGF 4 TUFF 5 HURT 2 You may throw a Boulder at Ruffthug if you have one. If Ruffthug reduces your TUFF score to zero, turn to 13. If you want to flee, turn to 47. If you reduce Ruffthug's TUFF score to zero, you have defeated Bronze the Merchant's elite bodyguard! Tick the box above. You are too big to enter Bronze's mansion, but you do manage to smash a few doors, reach in with a taloned fist, and pull some choice items out into the street. Add any of the following to your Sack: Barrel of Wine (1 Food Point), Roast Hog (1 Food Point), Silver Candelabra (1 Loot Point), Gilt-frame Portrait (1 Loot Point). When you are finished here, turn to 47."
  },
  "36": {
    "text": "Quickly, while the dead king's Gnomish subjects wail and lament his violent passing, you embark on a smash and grab campaign through the most accessible parts of the keep. This means all the chambers adjoining the central courtyard, where you can reach in with dirty fingers and grab the treasures of the castle. You cannot take the axe Trollslayer, it will burn your hand horribly, so you bury it under a pile of rubble. However, you can take any of the following: a Boulder (if you don't already have one), a Sack, a Barrel of Wine (1 Food Point), a Roast Ox (2 Food Points), a Mithril Tabard (2 Loot Points), a Silver Candelabra (1 Loot Point), a Gilt-frame Portrait (1 Loot Point). When you are finished here, turn to 27."
  },
  "37": {
    "text": "You are at the Workshop of Hicobemus the Alchemist. Tick off a Time Box. If you have ticked off five Time Boxes, turn to 50. Otherwise, you can go: South, to the Temple of Goff turn to 15 West, to Brilligan's Keep turn to 25"
  },
  "38": {
    "text": "The breached walls of Brilligan's Keep lie open like the shattered shell of an enormous Land Dragon. Columns of smoke rising from blackened flaming towers, and the bodies of the fallen are everywhere. Survivors from the King's palace guard have formed a ragged militia unit, and are beating off the occasional foray by rampaging gangs of looters. On seeing you, a detachment of militia charge noisily in your direction, screaming for bloody vengeance! \"The Destructor has returned!\" they howl. \"Death to the Destructor!\" You must fight the Gnomish militia as one opponent. GNOMISH RESISTANCE MILITIA STRENGF 2 TUFF 5 HURT 1 You may throw a Boulder at the Gnomish militia if you have one. If the militia reduces your TUFF score to zero, turn to 13. If you want to flee, turn to 27. If you reduce the militia's TUFF score to zero, you have beaten most of them off, and one of the survivors pulls a battered horn from his jacket and sounds the retreat with a discordant note. You see other militia units regrouping among the ruins of the keep, so you too decide to leave. As you leave, you can pull a Boulder from the rubble if you do not already have one, and add it to your Rampage Sheet. Turn to 27."
  },
  "39": {
    "text": "Beech drops her bow and draws a longsword. You must fight this strange Elven defender of animals. BEECH THE ELF RANGER STRENGF 3 TUFF 3 HURT 1 You may throw a Boulder at Beech if you have one. If Beech reduces your TUFF score to zero, turn to 13. If you want to flee, turn to 32. If you reduce Beech's TUFF score to zero, you have defeated the Elven ranger. You fall greedily upon the helpless livestock, slaughtering a bull on the spot and feasting on its still-warm flesh. Restore 2 TUFF points to your score if you are wounded. You can also add a Cow (2 Food Points) and an Ox (2 Food Points) to your Sack if you have enough space. Your actions have broken several of the pens and the surviving animals stampede! Add 1 Chaos Point and turn to 32."
  },
  "40": {
    "text": "If there is a tick in the above box, you have Been Here Before. Turn to 48. Otherwise, read on. The Workshop of Hicobemus the Alchemist is a most peculiar dwelling. It is built into the Groaning Bridge, which spans a loop of the Hagfish River as it flows through the northern part of Boulder Ford. The Workshop is all arches and columns, full of pumps and distillery apparatus powered by the riverís waters as it surges downstream. A door is slammed open, and out staggers the Gnomish alchemist Hicobemus, in stained grey robes, with a patched, pointy hat upon his head, and a long filthy beard that grows down to his feet. He's ridiculously drunk, you can smell the reek of distilled liquor from up here. Of more immediate concern is the bizarre apparatus strapped to his back. It appears to be some sort of pressurized tank, with a long segmented tube connecting it to a hand-held iron wand held in Hicobemus' right hand. \"Come on then, you bastard!\" he rants at you. \"I'll have ya! Say hello to my latest invention, I call it Dragon Breath!\" So saying he pulls a trigger on the iron wand and a jet of flame erupts from its tip, forcing you backwards. You must fight the intoxicated alchemist and his fiery secret weapon! HICOBEMUS THE ALCHEMIST STRENGF 2 TUFF 3 HURT 4 You may throw a Boulder at Hicobemus if you have one. If Hicobemus reduces your TUFF score to zero, turn to 13. If you want to flee, turn to 37. The first time you wound Hicobemus (including a Boulder strike, if you threw one at him), tick the box above, and turn to 29."
  },
  "41": {
    "text": "With a primal scream of fury you tear aside the castle's outer walls and storm into the central courtyard! Add 3 Chaos Point for breaching the defences of Brilligan's Keep. Right in the middle of things organizing the resistance, is King Brilligan the Great himself, clad in a mithril tabard, with a horned helm on his head and an iron shield on one arm. Clenched in his other hand, glinting cruelly in the sun, is the dread axe Trollslayer, bane of Big Folk everywhere! \"Hold!\" shouts King Brilligan, the feared axe raised aloft. \"I will fight you monster in single combat and you will perish here, by Groff's sacred sword!\" You become aware of an audience of Brilligan's subjects watching the two of you expectantly from the ruined battlements of the keep. You must fight the King of the Gnomes! KING BRILLIGAN THE GREAT STRENGF 4 TUFF 4 HURT 4 You may throw a Boulder at King Brilligan if you have one. If King Brilligan reduces your TUFF score to zero, turn to 13. If you want to flee, turn to 27. If you have reduced Brilligan's TUFF score to zero, you have slain the King of Boulder Ford! Add 3 Chaos Points for your incredible victory over a foe long-hated by the Big Folk, and turn to 36."
  },
  "42": {
    "text": "You are in the market place of Boulder Ford. Tick off a Time Box. If you have ticked off five Time Boxes, turn to 50. Otherwise, you can go: North, to the forge turn to 5 South, to the gate turn to 1 East, to the livestock pens turn to 30 West, to the Blue Crab Tavern turn to 20"
  },
  "43": {
    "text": "In all the chaos a pack of underfed dogs have needed little encouragement to go feral, and are now feasting on the carcasses of several dead cattle. Seeing you as fellow competition, they attack in a flurry of snarls and bared fangs. Fight them as one opponent. FERAL DOG PACK STRENGF 2 TUFF 4 HURT 1 You may throw a Boulder at the dog pack if you have one. If the dog pack reduces your TUFF score to zero, turn to 13. If you want to flee, turn to 32. If you reduce the dog pack's TUFF score to zero, you have beaten most of them off, and the rest slink away with their tails between their legs. Turn to 32."
  },
  "44": {
    "text": "Still flush with success from your recent conquest, you begin smashing holes in the domed roof of the Temple of Goff, looking for treasure. This enrages the high priest, a decrepit old balding Gnome in a scarlet robe, known as the Curer. He rushes out of the temple in a fury, frothing at the mouth and yelling near-incomprehensible obscenities at you. The Curer then waves a gnarled staff in the air and begins to pronounce a mystical chant. A glowing blue nimbus of light surrounds him, and as his prayers reach a screaming crescendo, he makes a stabbing gesture with the staff, pointing it directly at you. Blue light races down the priest's arm, along the staff, and arcs through the air towards you in a blast of divine energy. You have been ensorcelled by the Curer! Roll one die. If you roll under your SMARTS score, you shrug off the effects of the spell. Turn to 9. If you roll equal to or over your SMARTS score, you are now the victim of unknown sorcery! Turn to 24."
  },
  "45": {
    "text": "If there is a tick in the above box, you have Been Here Before. Turn to 33. Otherwise, read on. The market is in an uproar owing to your intrusion. Stall-holders are frantically shutting up shop, people are rushing all over the place, pack-animals are milling around in confusion, and Gnomish guards are everywhere trying to maintain order. You leisurely contemplate the rich pickings on offer, but one lone figure stands in your way. Roll one die to determine who: Roll 1 or 2 SOURNOSE THE GUARD STRENGF 3 TUFF 2 HURT 1 Roll 3 or 4 FATBELLY THE GUARD STRENGF 2 TUFF 3 HURT 1 Roll 5 or 6 A DANCING BEAR STRENGF 3 TUFF 5 HURT 2 You may throw a Boulder at your opponent if you have one. If your opponent reduces your TUFF score to zero, turn to 13. If you want to flee, turn to 42. If you reduce your opponent's TUFF score to zero, you stand triumphant amidst the ruins of the market place. Tick the box above, and add 1 Chaos Point. You strip the market of a few choice items, add a Barrel of Sausages (1 Food Point) and an Asantian Rug (1 Loot Point) to your Sack. When you have finished here, turn to 42."
  },
  "46": {
    "text": "The fiery blast of blue energy incinerates you where you stand! Roll one die and deduct the result from your TUFF score. If this reduces your TUFF score to zero, turn to 13. Otherwise, the blast also destroys your Sack and any items it contains. Cross them all off your Rampage Sheet. If you have two Sacks, only one is destroyed, you choose which one. It has no effect on your weapon or any items not in your Sack, such as a Boulder or a Shield. Still, at least you are alive. Blackened, charred, and scorched nearly to the bone, but still alive. Gastromo meanwhile, has used the diversion to waddle back into his tower and spell-lock the door. You can: Assault the tower turn to 18 Leave the area turn to 12"
  },
  "47": {
    "text": "You are at the mansion of Bronze the Merchant. Tick off a Time Box. If you have ticked off five Time Boxes, turn to 50. Otherwise, you can go: North, to Gastromo's Tower turn to 10 South, to the Blue Crab Tavern turn to 20 East, to the forge turn to 5"
  },
  "48": {
    "text": "The Workshop of Hicobemus, and indeed much of the Groaning Bridge, is little more that a steaming pile of rubble lying in the middle of the Hagfish River. A prolonged search of the debris turns up nothing apart from one of the following, which you may add to your Rampage Sheet: Roll 1 or 2 A Cured Ham (1 Food Point) Roll 3 or 4 A Keg of Beer (1 Food Point) Roll 5 or 6 A Potion of Healing (see below) If you find a Potion of Healing, it needs to be kept in a Sack if you have one, or you can drink it now. Drinking it now will restore your TUFF score to its original level at the start of this adventure. When you have finished here, turn to 37."
  },
  "49": {
    "text": "The tower of Gastromo the Wizard is now little more than a heap of white rubble, from which emanates wisps of sulphurous yellow smoke. You scrabble about in the debris looking for valuables, but succeed only in freeing a demon that must have previously been bound in Gastromo's cellar! It shoots up into the sky, hanging in the air above you, and taking the form of a bulky bat-winged ape with red skin and goat-like horns. \"Haha! Free at last!\" it howls with demonic glee, before spotting you. \"Yes, you'll do! I need to harvest souls for the Dark Master!\" Waving a rusty barbed trident in your direction, the Pit Demon swoops down on black wings to attack. PIT DEMON STRENGF 4 TUFF 4 HURT 2 You may throw a Boulder at the Pit Demon if you have one. If the Pit Demon reduces your TUFF score to zero, turn to 13. If you want to flee, turn to 12. If you have the Sword of Goff, you may add 1 point to your STRENGF score when fighting the Pit Demon. If you reduce the Pit Demon's TUFF score to zero, you have slain the foul hellspawn and banished it back to the Six Hells! It leaves behind a giant glowing ruby, add the Demon Gem (2 Loot Points) to your Sack if you wish. Hurriedly, you leave the area to avoid disturbing any more supernatural fiends. Turn to 12. However, if you have already fought one Pit Demon, then there is nothing more for you here. Turn to 12.",
    "type": "combat"
  },
  "50": {
    "text": "You think you've spent enough time sacking and looting the town of Boulder Ford, and decide to return to your cave and take stock of the booty you've acquired. Besides, King Yalamon of the Southlands has a garrison nearby, and you'll be damned to the Six Hells if you are still stuck here when his crack legions show up! Back in your humble lair, you empty out the contents of your Sack(s) and recount your exploits. Consult your Rampage Sheet, and add up all your Chaos Points, Loot Points, and Food Points into one total score. This total is the number of Rampage Points you achieved for this adventure. Compare your Rampage Points total to the chart below to see how well you did when you went on a RAMPAGE! 0-5 Carpet-bagger! You need practice at this looting malarkey! Your feeble endeavours have been laughed off by both your beast colleagues and your townsfolk foes as the turgid scratchings of a rank amateur. You need to embrace your inner monster and really cut loose in an orgy of senseless destruction. 6-10 Robber! Well, you caused a bit of havoc, but it was nuisance value more than anything else. Perhaps you will inspire some callow farmer's son to seek his fame and fortune by slaying you with a rusty blunderbuss. Your exploits are hardly the stuff of legend however, and you should try harder next time! 11-15 Marauder! Not a bad start to your rampaging career, but you still could do better. The evil warlord Malthus Fire wants you as a trusted sidekick for his dungeon lair. This is a bad thing though, because it means he doesn't consider you a threat, and that shows disrespect to your inner monster. Pull your leather breeches up and swing that weapon a bit harder! 16-20 Destroyer! A good solid beginning to a (hopefully) long life of looting and pillaging. You've done well. So well in fact, that a small band of beginning adventurers formed amidst the ruins of Boulder Ford following your rampage, with the express purpose of bringing you down! They consider you their arch-nemesis… 21-25 Obliterator! You've done very well in your rampaging, and are capable of wasting an entire town without much trouble. But your card is marked now! With your reputation being what it is, it won't be long before there is a long line of famed hireswords and sorcerous spellslingers beating the well-worn path to your lair. Be warned… 26+ Annihilator! You are the master of devastation! Your name is whispered throughout the lands of Gallansia as a despoiler without compare,by both fellow monsters and glory-seeking adventurers. Actually, that's the downside. King Yalamon has heard of your exploits and sent out the call for legendary heroes everywhere to slay you and protect the land from evil. Therein lies another tale… OPTIONAL RULES After you've played through RAMPAGE! a couple of times with the different starting characters, you might like to use any or all of the following optional rules, to keep the adventure fresh and replayable. Consider though that the aim of the game is to have fun, so if you find the rule or rules \"not fun\" then don't use them, or change them into something different. Top Ten Rampage Chart Below is a simple top ten Rampage Chart to record the details of your best RAMPAGE! characters. Bear in mind you can only do direct comparisons between characters using the same number of Time Boxes, so if you've changed this rule (see below), you'll have to use different Rampage Charts for different Time Box conditions. TOP TEN RAMPAGE CHART (Number of Time Boxes = ) 1. Name: Race: Sex: Rampage Points: (Chaos Points: Food Points: Loot Points: ) 2. Name: Race: Sex: Rampage Points: (Chaos Points: Food Points: Loot Points: ) 3. Name: Race: Sex: Rampage Points: (Chaos Points: Food Points: Loot Points: ) 4. Name: Race: Sex: Rampage Points: (Chaos Points: Food Points: Loot Points: ) 5. Name: Race: Sex: Rampage Points: (Chaos Points: Food Points: Loot Points: ) 6. Name: Race: Sex: Rampage Points: (Chaos Points: Food Points: Loot Points: ) 7. Name: Race: Sex: Rampage Points: (Chaos Points: Food Points: Loot Points: ) 8. Name: Race: Sex: Rampage Points: (Chaos Points: Food Points: Loot Points: ) 9. Name: Race: Sex: Rampage Points: (Chaos Points: Food Points: Loot Points: ) 10. Name: Race: Sex: Rampage Points: (Chaos Points: Food Points: Loot Points: ) Time and Time Boxes The limit of five Time Boxes was developed to provide a fixed length to the adventure. Smart readers, though, will have discovered that there are some sections of RAMPAGE! that are unreachable if you're playing with the five Time Boxes limit. For this reason, you might like to increase the number of Time Boxes on your Rampage Sheet to seven or even 10 Time Boxes, in order to allow you more time to reduce the town of Boulder Ford to dusty rubble. After you've ticked off seven or 10 Time Boxes, simply turn to 50 to check your Rampage Points score. Bear in mind though, that the more Time Boxes you allow, the easier it is increase your Rampage Points total. Conversely, reducing the number of Time Boxes is not a good idea as there would now be entire areas of Boulder Ford that are impossible to venture into and stay within the time limit. However, do feel free to play RAMPAGE! without any Time Boxes whatsoever, if you just want to explore the town and the adventure that takes place upon its blood-soaked streets and roads. Creating New Characters Once you've played through RAMPAGE! with the starting characters, you might like to start creating your own. This is extremely easy to do, using the following process: 1. Split 16 points among the following: a. STRENGF (anywhere from 2 to 6) b. TUFF (anywhere from 2 to 6) c. SMARTS (anywhere from 2 to 6) d. A weapon from the following (cost in points equals HURT value): i. Spiked Club (HURT 1) ii. Stone Axe (HURT 2) iii. Steel Cleaver (HURT 3) e. Any of the following extra equipment at 1 point each (and you already start with 1 Sack, at no extra cost): i. A Boulder ii. An extra Sack 2. Chose your character's Sex and give them a Name. 3. Chose your character's Race. They could be a standard Troll, Ogre, or Giant, like the starting characters. Alternatively, you could choose a new race that is similar in nature, such as a Minotaur, a Cyclops, or a Great Ape (see below in the Special Abilities section for more information about this). 4. Give your character a colorful background, and unleash them upon the world of RAMPAGE! An Example of Character Creation Warren is bored witless with the standard characters and wants to create someone with a bit more bang. This is how he does it: 1. He splits 16 points, allocating 6 each for his STRENGF and TUFF scores, and 2 for his SMARTS score. 14 points spent, two left, which he spends on a Stone Axe (HURT 2) 2. Warren decides his character is female, and her name is Brunda Bogglebum. 3. He thinks she'd make a good new race, so he writes down that Brunda is in fact a Cyclops. 4. He comes up with a quick, entertaining background: Brunda Bogglebum was originally from Skull Island, off the southern coast of Gallansia. She was washed out to sea by a freak wave while harvesting sea cucumbers, and ended up on the shores of the mainland. She settled near Boulder Ford as she'd heard of the Temple of Goff, and Goff is a deity also worshipped by Cyclops. However, the xenophobic Gnomes turned her away from the town and temple, and since that day she has sworn bloody vengeance against King Brilligan and Boulder Ford. New Races and Special Abilities As seen above, you may wish to create alternative races for your new characters that are exploring the world of RAMPAGE! One good way to take this customization a step further is to construct low-powered Special Abilities for the various races, to add some individuality to your characters. Some sample Special Abilities are given below, but feel free to edit these as you see fit, and propose new abilities for new races. Troll: Cannibal: Trolls will eat anything. Add 1 TUFF point at anytime you defeat a group of Gnomish opponents (such as a Gnomish mob) to reflect your Troll character feasting on the bodies of the dead after the battle. Ogre: Fireproof: As a race Ogres were forged in the warp furnaces of Chaos and are resistant to fire-based damage. Deduct one point from the amount of damage you have to suffer every time you are wounded by fires, explosions, and magic spells using flames, except if the damage is already one point, in which case there is no effect. Giant: Strong: Giants are immensely strong. At any time you need to roll one die and compare the result to your STRENGF score, you may deduct one from the die roll. Minotaur: Charge: Minotaurs charge into battle hoping to impale their foes on great curving horns. If you win the first Battle Turn, treat the Charge as the same as a HURT 3 weapon. Cyclops: Deadeye: Any Cyclops loves chucking stuff about, especially big rocks. At any time you roll a die and compare it to your SMARTS score in order to throw a Boulder, you may deduct one from the roll. Great Ape: Battle Howl: At the start of any battle you embark on a tirade of howling and chest thumping to unnerve your opponent. You may deduct one from their die roll in the first Battle Turn only, to represent this potential loss of courage. RAMPAGE! by Andrew Wright",
    "conditionnals": {
      "already_passed": {},
      "dice": {}
    }
  }
}
