{
    "action": {
        "text": "If there is a tick in the above box, you have Been Here Before. Turn to 14. Otherwise, read on. The gates of Boulder Ford are made of thick oak reinforced with iron bands, and set within a sturdy stone gatehouse. Still, that should pose little problem to a determined beast such as yourself. Ignoring the shouts and screams of the Gnomish guards, you proceed to wrench the gates apart. Roll one die. If it is less than your STRENGF score, tick the box above, and turn to 26. If it is equal to or greater than your STRENGF score, you fail to open the gate. Deduct one point from your TUFF score to reflect both your efforts and the Gnomish arrows bouncing off your hardened hide. If your TUFF score is now zero, turn to 13. Otherwise, try again by rolling one die and comparing it to your STRENGF score in the manner above. Keep doing this until you either open the gates, or die trying! Alternatively, you could decide the whole thing is too much hard work and wander back to your cave. If you decide to do this, turn to 50.",
        "type": "story",
        "choices": [
            {
                "text": "Try to open the gates",
                "require": {
                    "action": {
                        "type": "dice",
                        "diceResult": [
                            {
                                "goto": 26,
                                "stat": "strength",
                                "operator": "<",
                                "checkType": "comparison",
                                "successText": "You have opened the gates"
                            },
                            {
                                "stat": "strength",
                                "impact": {
                                    "stats": {
                                        "resistance": {
                                            "value": 1,
                                            "operator": "-"
                                        }
                                    }
                                },
                                "operator": ">=",
                                "checkType": "comparison",
                                "failureText": "You fail to open the gate"
                            }
                        ],
                        "numberOfDice": 1
                    }
                }
            },
            {
                "goto": 50,
                "text": "Go back to your cave"
            }
        ],
        "alreadyVisited": "14"
    }
}